service-chain-editor/iceclass.wsdl

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://wps.nersc.no/cgi-bin/wps.py_wsdl" targetNamespace="http://wps.nersc.no/cgi-bin/wps.py_wsdl"><types><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/ows/1.1"><include schemaLocation="http://schemas.opengis.net/ows/1.1.0/owsExceptionReport.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsGetCapabilities_request.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsGetCapabilities_response.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsDescribeProcess_request.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsDescribeProcess_response.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsExecute_request.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsExecute_response.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/ows/1.1"><include schemaLocation="http://schemas.opengis.net/ows/1.1.0/owsExceptionReport.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcess_getIceClassMapsAsar"><complexType><sequence><element minOccurs="1" maxOccurs="1" name="scenedate" type="xsd:string"/><element minOccurs="1" maxOccurs="1" name="sceneregion" type="xsd:string"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcess_getIceClassMapsAsarResponse"><complexType><sequence><element name="textResult" minOccurs="1" maxOccurs="1" type="xsd:integer"/><element name="IceClassMapResult" minOccurs="1" maxOccurs="1"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcessAsync_getIceClassMapsAsar"><complexType><sequence><element minOccurs="1" maxOccurs="1" name="scenedate" type="xsd:string"/><element minOccurs="1" maxOccurs="1" name="sceneregion" type="xsd:string"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcessAsync_getIceClassMapsAsarResponse"><complexType><sequence><element name="statusURLResult" minOccurs="1" maxOccurs="1"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcess_getIceClassMapsAsarGeoTIFF"><complexType><sequence><element minOccurs="1" maxOccurs="1" name="scenedate" type="xsd:string"/><element minOccurs="1" maxOccurs="1" name="sceneregion" type="xsd:string"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcess_getIceClassMapsAsarGeoTIFFResponse"><complexType><sequence><element name="textResult" minOccurs="1" maxOccurs="1" type="xsd:integer"/><element name="IceClassMapResult" minOccurs="1" maxOccurs="1"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFF"><complexType><sequence><element minOccurs="1" maxOccurs="1" name="scenedate" type="xsd:string"/><element minOccurs="1" maxOccurs="1" name="sceneregion" type="xsd:string"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFResponse"><complexType><sequence><element name="statusURLResult" minOccurs="1" maxOccurs="1"/></sequence></complexType></element></schema></types><message name="GetCapabilitiesRequest"><part name="msg" element="wps:GetCapabilities"/></message><message name="GetCapabilitiesResponse"><part name="msg" element="wps:Capabilities"/></message><message name="DescribeProcessRequest"><part name="msg" element="wps:DescribeProcess"/></message><message name="DescribeProcessResponse"><part name="msg" element="wps:ProcessDescriptions"/></message><message name="ExecuteRequest"><part name="msg" element="wps:Execute"/></message><message name="ExecuteResponse"><part name="msg" element="wps:ExecuteResponse"/></message><message name="ExceptionResponse"><part name="msg" element="ows:Exception"/></message><message name="ExecuteProcess_getIceClassMapsAsarRequest"><part name="DataInputs" element="wps:ExecuteProcess_getIceClassMapsAsar"/></message><message name="ExecuteProcess_getIceClassMapsAsarResponse"><part name="ProcessOutputs" element="wps:ExecuteProcess_getIceClassMapsAsarResponse"/></message><message name="ExecuteProcessAsync_getIceClassMapsAsarRequest"><part name="DataInputs" element="wps:ExecuteProcessAsync_getIceClassMapsAsar"/></message><message name="ExecuteProcessAsync_getIceClassMapsAsarResponse"><part name="ProcessOutputs" element="wps:ExecuteProcessAsync_getIceClassMapsAsarResponse"/></message><message name="ExecuteProcess_getIceClassMapsAsarGeoTIFFRequest"><part name="DataInputs" element="wps:ExecuteProcess_getIceClassMapsAsarGeoTIFF"/></message><message name="ExecuteProcess_getIceClassMapsAsarGeoTIFFResponse"><part name="ProcessOutputs" element="wps:ExecuteProcess_getIceClassMapsAsarGeoTIFFResponse"/></message><message name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFRequest"><part name="DataInputs" element="wps:ExecuteProcessAsync_getIceClassMapsAsarGeoTIFF"/></message><message name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFResponse"><part name="ProcessOutputs" element="wps:ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFResponse"/></message><portType name="PywpsServer_PortType"><operation name="GetCapabilities"><input message="tns:GetCapabilitiesRequest"/><output message="tns:GetCapabilitiesResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="DescribeProcess"><input message="tns:DescribeProcessRequest"/><output message="tns:DescribeProcessResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="Execute"><input message="tns:ExecuteRequest"/><output message="tns:ExceptionResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="ExecuteProcess_getIceClassMapsAsar"><input message="tns:ExecuteProcess_getIceClassMapsAsarRequest"/><output message="tns:ExecuteProcess_getIceClassMapsAsarResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="ExecuteProcessAsync_getIceClassMapsAsar"><input message="tns:ExecuteProcessAsync_getIceClassMapsAsarRequest"/><output message="tns:ExecuteProcessAsync_getIceClassMapsAsarResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="ExecuteProcess_getIceClassMapsAsarGeoTIFF"><input message="tns:ExecuteProcess_getIceClassMapsAsarGeoTIFFRequest"/><output message="tns:ExecuteProcess_getIceClassMapsAsarGeoTIFFResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFF"><input message="tns:ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFRequest"/><output message="tns:ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation></portType><binding name="PywpsServer_Binding" type="tns:PywpsServer_PortType"><binding xmlns="http://schemas.xmlsoap.org/wsdl/soap/" style="document" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="GetCapabilities"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/GetCapabilities" style="document"/><input name="GetCapabilitiesRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="GetCapabilitiesResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="DescribeProcess"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/DescribeProcess" style="document"/><input name="DescribeProcessRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="DescribeProcessResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="Execute"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/Execute" style="document"/><input name="ExecuteRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="ExecuteProcess_getIceClassMapsAsar"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/ExecuteProcess_getIceClassMapsAsar" style="document"/><input name="ExecuteProcess_getIceClassMapsAsarRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteProcess_getIceClassMapsAsarResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="ExecuteProcessAsync_getIceClassMapsAsar"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/ExecuteProcessAsync_getIceClassMapsAsar" style="document"/><input name="ExecuteProcessAsync_getIceClassMapsAsarRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteProcessAsync_getIceClassMapsAsarResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="ExecuteProcess_getIceClassMapsAsarGeoTIFF"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/ExecuteProcess_getIceClassMapsAsarGeoTIFF" style="document"/><input name="ExecuteProcess_getIceClassMapsAsarGeoTIFFRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteProcess_getIceClassMapsAsarGeoTIFFResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFF"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://wps.nersc.no/cgi-bin/wps.py/ExecuteProcessAsync_getIceClassMapsAsarGeoTIFF" style="document"/><input name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteProcessAsync_getIceClassMapsAsarGeoTIFFResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation></binding><service name="PywpsServer"><documentation/><port name="PywpsServer_Port" binding="tns:PywpsServer_Binding"><address xmlns="http://schemas.xmlsoap.org/wsdl/soap/" location="http://wps.nersc.no/cgi-bin/wps.py"/></port></service></definitions>